blog/org-mode-1.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Why I left Obsidian for Emacs Org-mode</title>
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/png" href="/images/favicon.png">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Lora:ital,wght@0,400;0,600;1,400&display=swap" rel="stylesheet">
<link rel="stylesheet" href="../blog.css">
</head>
<body>
<div id="content" class="content">
<div class="page-wrap">
<a href="../blog.html" class="back">← all posts</a>
<header class="post-header">
  <span class="post-label">ai</span>
  <h1 class="post-title">Why I left Obsidian for Emacs Org-mode</h1>
  <div class="post-meta">
    <span>19 Aug 2025</span>
    <span class="post-meta-sep">·</span>
    <span>7 min read</span>
    <span class="post-meta-sep">·</span>
    <span>vmargb</span>
  </div>
</header>
<div id="outline-container-org175ae0a" class="outline-2">
<h2 id="org175ae0a">Why I Left Obsidian for Emacs Org-roam (And Why You Probably Shouldn't)</h2>
<div class="outline-text-2" id="text-org175ae0a">
<p>
Every few months someone rediscovers Obsidian and posts about it on Hacker News or YouTube, and the cycle begins again. I was one of those people once. I spent a weekend migrating all my notes(from google keep) into a vault, installed all the essential plugins, and felt genuinely productive for about three weeks or so.
</p>

<p>
This isn't an "Obsidian is bad" post. Obsidian is genuinely good, if not one of the best pieces of software that has graced us. But after using Emacs and Org-mode seriously for the past year, there is just simply no going back(annoyingly)
</p>

<p>
The problem isn't the features. It's that Markdown is fundamentally inadequate for what I actually want to do with my notes, and Obsidian inherits every limitation of that format. Org-mode however is a completely different category of tool that happens to also do notes.
</p>
</div>
<div id="outline-container-orgf09a164" class="outline-3">
<h3 id="orgf09a164">What Obsidian gets right</h3>
<div class="outline-text-3" id="text-orgf09a164">
<p>
The onboarding is essentially frictionless. You open it, point it at a folder, and you have a note-taking app. The graph view is attractive and the plugin ecosystem is the best out there, and the defaults are sensible. If you're a normal person who wants to immediately take notes in a frictionless way, you might as well stop reading here, Obsidian is the right answer.
</p>
</div>
</div>
<div id="outline-container-org8306127" class="outline-3">
<h3 id="org8306127">Where it started to fall apart for me</h3>
<div class="outline-text-3" id="text-org8306127">
<p>
The problem wasn't any single feature. It was the accumulated weight of the Electron app sitting between me and a text file. Every time I wanted to do something slightly non-standard, run a script against my notes, grep across them, pipe them into something else, harpoon across my frequently used notes. I was constantly reminded that this was a tool designed for non-developers.
</p>

<p>
My notes are just files on disk. The idea that I should have to open a specific application to interact with them started to feel absurd. With Org files, every tool I already know works: <code>grep</code>, <code>sed</code>, <code>find</code>, <code>git diff</code>, anything. They're plain text.
</p>

<blockquote>
<p>
The test I now apply to any tool: if the company shut down tomorrow, or the app stopped working, would I lose anything I can't recover? With Obsidian vaults on disk, the answer is no. But the habits and workflows built around the GUI are a different kind of lock-in.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgacea25e" class="outline-3">
<h3 id="orgacea25e">Why Org-mode</h3>
<div class="outline-text-3" id="text-orgacea25e">
<p>
I write documentation in Markdown. I write READMEs in Markdown. It's perfect for those things.
</p>


<p>
But using Markdown for a serious knowledge base has always been limited. It works, technically. You'll get there eventually. But you're making it harder than it needs to be.
</p>

<p>
Here's what I mean:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Feature</th>
<th scope="col" class="org-left">Markdown + Obsidian</th>
<th scope="col" class="org-left">Org-mode</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">TODO tracking</td>
<td class="org-left">Plugin (Tasks, Kanban)</td>
<td class="org-left">Built-in, with states</td>
</tr>

<tr>
<td class="org-left">Code execution</td>
<td class="org-left">Plugin (Execute Code)</td>
<td class="org-left">Built-in (org-babel)</td>
</tr>

<tr>
<td class="org-left">Tables</td>
<td class="org-left">Basic, painful to edit</td>
<td class="org-left">Spreadsheet-like, editable</td>
</tr>

<tr>
<td class="org-left">Citations</td>
<td class="org-left">Plugin (Citations)</td>
<td class="org-left">Built-in (org-cite)</td>
</tr>

<tr>
<td class="org-left">Agenda/scheduling</td>
<td class="org-left">Plugin (Calendar, Tasks)</td>
<td class="org-left">Built-in, decades of refinement</td>
</tr>

<tr>
<td class="org-left">Export formats</td>
<td class="org-left">PDF, HTML (via plugins)</td>
<td class="org-left">Everything, natively</td>
</tr>

<tr>
<td class="org-left">Custom queries</td>
<td class="org-left">Dataview (learn a DSL)</td>
<td class="org-left">Org query language + Elisp</td>
</tr>
</tbody>
</table>

<p>
None of these are dealbreakers individually. But the pattern is clear: Obsidian needs plugins for things Org-mode has had since 2008. And plugins mean maintenance, compatibility issues, and someone else's timeline for features you need.
</p>

<p>
The other thing: Markdown has <i>no semantic structure</i> beyond headings, lists, and links. Org-mode has properties, drawers, blocks, source code with language-specific highlighting and execution, LaTeX math that actually works with exporting and conversions, footnotes that don't break your export, etc&#x2026; the list goes on.
</p>
</div>
</div>
<div id="outline-container-org4913168" class="outline-3">
<h3 id="org4913168">What Org-roam actually is</h3>
<div class="outline-text-3" id="text-org4913168">
<p>
Org-roam is a package for Emacs that implements a Zettelkasten-style note graph on top of Org mode. It gives you bidirectional links and a node database (SQLite under the hood) for a daily journal workflow. But still all operating on ordinary <code>.org</code> files.
</p>

<p>
The relevant bits of my config:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org-roam
  :custom
  (org-roam-directory "~/notes/roam")
  (org-roam-completion-everywhere t)
  :bind
  (("C-c n f" . org-roam-node-find)
   ("C-c n i" . org-roam-node-insert)
   ("C-c n c" . org-roam-capture)
   ("C-c n j" . org-roam-dailies-capture-today))
  :config
  (org-roam-db-autosync-mode))
</pre>
</div>

<p>
That's most of it. <code>org-roam-node-find</code> opens a fuzzy-search over all your nodes. <code>org-roam-node-insert</code> creates a link inline while you're writing. The dailies workflow gives you a journal entry per day, automatically linked to whatever nodes you reference in it.
</p>

<blockquote>
<p>
If you're curious about this without committing to full Emacs, Denote is a simpler Emacs package that does the file-linking part without the database. It's a much gentler entry point.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgd0db716" class="outline-3">
<h3 id="orgd0db716">The things I can't do in Obsidian</h3>
<div class="outline-text-3" id="text-orgd0db716">
<p>
Now everything I described above just demonstrates that both applications <i>can</i> do the same thing. The difference is that Emacs as an application is far superior to Obsidian for my actual workflow, because Emacs is an environment and Obsidian is a silo.
</p>

<p>
As a developer, I live in my editor. My terminal is inside my editor. My git client is inside my editor. My project navigation is inside my editor. When I switch to Obsidian to take a note, I am leaving my work environment. I lose my keybindings. I lose my project context. I lose the ability to fd or grep across my project and notes simultaneously without opening a separate window.
</p>

<p>
In Emacs, an Org file is just another buffer. It obeys the same rules as a Python file or a Rust file.
</p>

<p>
The cognitive load of context switching is real. I didn't realize how much friction I was accepting until I removed it. Every time I alt-tabbed to Obsidian, there was a micro-pause where my brain had to switch modes from "coding" to "note-taking."
</p>

<p>
This extends to customization. If I want Obsidian to behave differently, I install a plugin written by someone else, hoping it doesn't break on the next update. If I want Emacs to behave differently, I write ten lines of Elisp in my <code>init.el</code>.
</p>

<p>
This is why I can't go back. It's not about the notes. It's about the workflow. Obsidian asks me to adapt to its way of working. Emacs adapts to me.
</p>
</div>
</div>
<div id="outline-container-orgac682ed" class="outline-3">
<h3 id="orgac682ed">The honest tradeoffs (and why I still chose this)</h3>
<div class="outline-text-3" id="text-orgac682ed">
<p>
The Emacs learning curve is real and I won't pretend otherwise. I've been using it for a year and I'm still learning new things. The configuration is Lisp, which is either delightful or horrifying depending on your prior coding experience(if any). The worst is that there is no sophisticated cross-platform mobile solution worth using. Syncing requires you to sort it out yourself(syncthing, dropbox, git etc.)
</p>

<hr>

<p>
If that resonates, it might be worth trying. If it doesn't, Obsidian is excellent. The best notes system is the one you actually use.
</p>

<p>
But if you find yourself wanting more — wanting your notes to <i>do</i> things, not just <i>be</i> things — then Org-mode is waiting. It's been waiting since 1990. It'll probably be here in 2050 too. Obsidian might not be. That's the kind of bet I'm willing to make.
</p>

<footer class="post-footer">
  <a href="../blog.html">← back to blog</a>
  <span>Published 19 Aug 2025</span>
</footer>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
